V1/Data/ambient/600-4-wrk2-hh4lr.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 9.588ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.784ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.798ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.812ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.997ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.824ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.990ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.810ms, rate sampling interval: 24ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.05ms    1.71ms  29.15ms   73.09%
    Req/Sec    25.41     65.41   304.00     87.60%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    8.81ms
 75.000%    9.94ms
 90.000%   11.18ms
 99.000%   14.29ms
 99.900%   19.04ms
 99.990%   24.03ms
 99.999%   26.70ms
100.000%   29.17ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       4.715     0.000000            1         1.00
       7.163     0.100000         5793         1.11
       7.675     0.200000        11581         1.25
       8.075     0.300000        17347         1.43
       8.455     0.400000        23208         1.67
       8.815     0.500000        28970         2.00
       9.007     0.550000        31884         2.22
       9.207     0.600000        34767         2.50
       9.431     0.650000        37618         2.86
       9.671     0.700000        40487         3.33
       9.943     0.750000        43418         4.00
      10.087     0.775000        44830         4.44
      10.255     0.800000        46276         5.00
      10.447     0.825000        47728         5.71
      10.663     0.850000        49181         6.67
      10.887     0.875000        50614         8.00
      11.023     0.887500        51351         8.89
      11.175     0.900000        52036        10.00
      11.351     0.912500        52771        11.43
      11.551     0.925000        53490        13.33
      11.783     0.937500        54225        16.00
      11.911     0.943750        54572        17.78
      12.071     0.950000        54947        20.00
      12.239     0.956250        55296        22.86
      12.431     0.962500        55653        26.67
      12.679     0.968750        56011        32.00
      12.831     0.971875        56194        35.56
      13.007     0.975000        56374        40.00
      13.191     0.978125        56550        45.71
      13.375     0.981250        56732        53.33
      13.639     0.984375        56916        64.00
      13.775     0.985938        57002        71.11
      13.927     0.987500        57092        80.00
      14.119     0.989062        57185        91.43
      14.383     0.990625        57274       106.67
      14.695     0.992188        57364       128.00
      14.895     0.992969        57407       142.22
      15.087     0.993750        57454       160.00
      15.407     0.994531        57497       182.86
      15.767     0.995313        57544       213.33
      16.223     0.996094        57588       256.00
      16.447     0.996484        57610       284.44
      16.815     0.996875        57635       320.00
      17.087     0.997266        57655       365.71
      17.311     0.997656        57678       426.67
      17.695     0.998047        57702       512.00
      17.983     0.998242        57712       568.89
      18.271     0.998437        57723       640.00
      18.463     0.998633        57734       731.43
      18.783     0.998828        57747       853.33
      19.087     0.999023        57757      1024.00
      19.311     0.999121        57763      1137.78
      19.519     0.999219        57768      1280.00
      19.903     0.999316        57774      1462.86
      20.095     0.999414        57780      1706.67
      20.639     0.999512        57785      2048.00
      20.783     0.999561        57788      2275.56
      20.831     0.999609        57791      2560.00
      21.023     0.999658        57794      2925.71
      21.439     0.999707        57797      3413.33
      22.079     0.999756        57799      4096.00
      22.287     0.999780        57801      4551.11
      22.527     0.999805        57802      5120.00
      22.607     0.999829        57804      5851.43
      23.663     0.999854        57805      6826.67
      23.871     0.999878        57806      8192.00
      24.031     0.999890        57807      9102.22
      24.159     0.999902        57809     10240.00
      24.159     0.999915        57809     11702.86
      24.159     0.999927        57809     13653.33
      24.191     0.999939        57810     16384.00
      24.191     0.999945        57810     18204.44
      24.927     0.999951        57811     20480.00
      24.927     0.999957        57811     23405.71
      24.927     0.999963        57811     27306.67
      26.703     0.999969        57812     32768.00
      26.703     0.999973        57812     36408.89
      26.703     0.999976        57812     40960.00
      26.703     0.999979        57812     46811.43
      26.703     0.999982        57812     54613.33
      29.167     0.999985        57813     65536.00
      29.167     1.000000        57813          inf
#[Mean    =        9.049, StdDeviation   =        1.709]
#[Max     =       29.152, Total count    =        57813]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60008 requests in 5.00m, 29.22MB read
Requests/sec:    200.02
Transfer/sec:     99.75KB