V1/Data/ambient/600-5-wrk2-rg955.log
Running 5m test @ http://face/
  8 threads and 200 connections
  Thread calibration: mean lat.: 9.963ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.945ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 10.085ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.933ms, rate sampling interval: 24ms
  Thread calibration: mean lat.: 9.960ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.982ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 10.050ms, rate sampling interval: 25ms
  Thread calibration: mean lat.: 9.775ms, rate sampling interval: 25ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     9.58ms    1.88ms  38.56ms   74.90%
    Req/Sec    25.43     65.22   347.00     87.42%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    9.33ms
 75.000%   10.52ms
 90.000%   11.83ms
 99.000%   15.26ms
 99.900%   23.12ms
 99.990%   32.90ms
 99.999%   36.42ms
100.000%   38.59ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       5.179     0.000000            1         1.00
       7.567     0.100000         5785         1.11
       8.107     0.200000        11574         1.25
       8.535     0.300000        17353         1.43
       8.935     0.400000        23140         1.67
       9.327     0.500000        28931         2.00
       9.535     0.550000        31828         2.22
       9.751     0.600000        34738         2.50
       9.975     0.650000        37584         2.86
      10.231     0.700000        40517         3.33
      10.519     0.750000        43377         4.00
      10.679     0.775000        44831         4.44
      10.863     0.800000        46295         5.00
      11.047     0.825000        47710         5.71
      11.263     0.850000        49151         6.67
      11.527     0.875000        50608         8.00
      11.671     0.887500        51309         8.89
      11.831     0.900000        52031        10.00
      12.007     0.912500        52767        11.43
      12.207     0.925000        53487        13.33
      12.447     0.937500        54209        16.00
      12.575     0.943750        54570        17.78
      12.719     0.950000        54930        20.00
      12.895     0.956250        55297        22.86
      13.103     0.962500        55651        26.67
      13.359     0.968750        56015        32.00
      13.495     0.971875        56193        35.56
      13.647     0.975000        56367        40.00
      13.855     0.978125        56548        45.71
      14.087     0.981250        56729        53.33
      14.399     0.984375        56911        64.00
      14.583     0.985938        56997        71.11
      14.807     0.987500        57087        80.00
      15.055     0.989062        57177        91.43
      15.399     0.990625        57267       106.67
      15.759     0.992188        57358       128.00
      16.015     0.992969        57402       142.22
      16.263     0.993750        57448       160.00
      16.495     0.994531        57493       182.86
      16.895     0.995313        57538       213.33
      17.471     0.996094        57584       256.00
      17.727     0.996484        57606       284.44
      18.063     0.996875        57628       320.00
      18.671     0.997266        57650       365.71
      19.391     0.997656        57673       426.67
      20.063     0.998047        57696       512.00
      20.479     0.998242        57707       568.89
      20.799     0.998437        57718       640.00
      21.791     0.998633        57729       731.43
      22.559     0.998828        57741       853.33
      23.439     0.999023        57752      1024.00
      24.719     0.999121        57758      1137.78
      25.071     0.999219        57763      1280.00
      25.551     0.999316        57769      1462.86
      26.223     0.999414        57775      1706.67
      26.975     0.999512        57780      2048.00
      27.183     0.999561        57783      2275.56
      27.775     0.999609        57786      2560.00
      28.447     0.999658        57789      2925.71
      29.343     0.999707        57792      3413.33
      29.455     0.999756        57794      4096.00
      30.751     0.999780        57796      4551.11
      31.359     0.999805        57797      5120.00
      32.607     0.999829        57799      5851.43
      32.799     0.999854        57801      6826.67
      32.799     0.999878        57801      8192.00
      32.895     0.999890        57802      9102.22
      34.175     0.999902        57804     10240.00
      34.175     0.999915        57804     11702.86
      34.175     0.999927        57804     13653.33
      34.815     0.999939        57805     16384.00
      34.815     0.999945        57805     18204.44
      35.391     0.999951        57806     20480.00
      35.391     0.999957        57806     23405.71
      35.391     0.999963        57806     27306.67
      36.415     0.999969        57807     32768.00
      36.415     0.999973        57807     36408.89
      36.415     0.999976        57807     40960.00
      36.415     0.999979        57807     46811.43
      36.415     0.999982        57807     54613.33
      38.591     0.999985        57808     65536.00
      38.591     1.000000        57808          inf
#[Mean    =        9.579, StdDeviation   =        1.879]
#[Max     =       38.560, Total count    =        57808]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  60008 requests in 5.00m, 29.23MB read
Requests/sec:    200.02
Transfer/sec:     99.76KB